src/Catalogs/НалоговыеНазначенияАктивовИЗатрат/НалоговыеНазначенияАктивовИЗатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НалоговыеНазначенияАктивовИЗатрат</name>
  <comment>(Регл)</comment>
  <predefined>
    <items>
      <name>НДС_НеоблагаемаяХозДеятельность</name>
      <description>Необл. НДС, любая хоз.</description>
    </items>
    <items>
      <name>НДС_НеоблагаемаяНеХозДеятельность</name>
      <description>Необл. НДС, нехоз.</description>
    </items>
    <items>
      <name>НДС_Облагаемая</name>
      <description>Обл. НДС</description>
    </items>
    <items>
      <name>НДС_Пропорционально</name>
      <description>Пропорц. обл. НДС</description>
    </items>
    <items>
      <name>Управленческое</name>
      <description>Управленческое</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидДеятельностиНДС</name>
    <type>
      <types>EnumRef.ВидыДеятельностиНДС</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/НалоговыеНазначенияАктивовИЗатрат/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбновлениеИнформационнойБазы
	
Процедура НачальноеЗаполнение() Экспорт
	
	Обработки.НачальноеЗаполнениеИОбновлениеОбъектов.ЗаполнитьОбъект("Справочник", "НалоговыеНазначенияАктивовИЗатрат");	
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли

Функция ПолучитьСписокНалоговыхНазначенийОС(НалоговоеНазначениеОборудования) Экспорт
	
	СписокНалоговыхНазначенийОС = Новый СписокЗначений;
	
	Если НЕ ЗначениеЗаполнено(НалоговоеНазначениеОборудования) Тогда
		Возврат СписокНалоговыхНазначенийОС;
	КонецЕсли;	
	
	СписокНалоговыхНазначенийОС.Добавить(НалоговоеНазначениеОборудования);
	
	Если НалоговоеНазначениеОборудования = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Пропорционально Тогда
		СписокНалоговыхНазначенийОС.Добавить(Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Облагаемая);
		СписокНалоговыхНазначенийОС.Добавить(Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяХозДеятельность);
	ИначеЕсли НалоговоеНазначениеОборудования = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Облагаемая Тогда
//		СписокНалоговыхНазначенийОС.Добавить(Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Облагаемая);
	ИначеЕсли НалоговоеНазначениеОборудования = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяХозДеятельность Тогда
		СписокНалоговыхНазначенийОС.Добавить(Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность);
	ИначеЕсли НалоговоеНазначениеОборудования = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность Тогда
		СписокНалоговыхНазначенийОС.Добавить(Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяХозДеятельность);
	КонецЕсли;	
		
	
	Возврат СписокНалоговыхНазначенийОС;
	
КонецФункции // ПолучитьСписокНалоговыхНазначенийОС

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.Добавить(Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Облагаемая, Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Облагаемая.Наименование);
	ДанныеВыбора.Добавить(Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяХозДеятельность, Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяХозДеятельность.Наименование);
	ДанныеВыбора.Добавить(Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность, Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность.Наименование);
	ДанныеВыбора.Добавить(Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Пропорционально, Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_Пропорционально.Наименование);
	
КонецПроцедуры
